config/DataProcessors/ЭлементыИРеквизиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЭлементыИРеквизиты</Name>
			<Comment>Элементы, реквизиты, переключатели и флажки</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Переключатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НашФлаг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

config/DataProcessors/ЭлементыИРеквизиты/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Старт(Команда)
	
	Поле3 = Поле1 + Поле2 + Объект.Поле4;
	Если Поле3 < 15 Тогда
		Элементы.Поле4.Видимость = Ложь;
	Иначе 
		Элементы.Поле4.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательПриИзменении(Элемент)
	
	Если Объект.Переключатель = 1 Тогда
		Поле1 = 10;
	ИначеЕсли Объект.Переключатель = 2 Тогда
		Поле2 = 20;
	ИначеЕсли Объект.Переключатель = 3 Тогда
		Поле3 = 0;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НашФлагПриИзменении(Элемент)
	
	Если Объект.НашФлаг = Истина Тогда
		Элементы.Группа1.Доступность = Ложь;
		//Элементы.Поле1.Доступность = Ложь;
		//Элементы.Поле2.Доступность = Ложь;
		//Элементы.Поле3.Доступность = Ложь;
		//Элементы.Поле4.Доступность = Ложь;
	Иначе                            
		Элементы.Группа1.Доступность = Истина;
		//Элементы.Поле1.Доступность = Истина;
		//Элементы.Поле2.Доступность = Истина;
		//Элементы.Поле3.Доступность = Истина;
		//Элементы.Поле4.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры
